#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//int main()
//{
//	float f = 5.5;
//	//5.5
//	//101.1
//	//(-1)^0 * 1.011 * 2^2
//	//S=0
//	//M=011
//	//E=2
//	//0 10000001 01100000000000000000000
//	//0100 0000 1011 0000 0000 0000 0000 0000
//	//0x40b00000
//	return 0;
//}



//int main()
//{
//	int n = 9;
//	//0 00000000 00000000000000000001001 - 补码
//	float* pfloat = (float*)&n;
//	printf("n的值为：%d\n", n);  //9
//	printf("*pfloat的值为：%f\n", *pfloat);  //0.000000
//
//	*pfloat = 9.0;
//	//(-1)^0 * 1.001 * 2^3
//	//S=0
//	//M=001
//	//E=3
//	//0 10000010 00100000000000000000000
//	//01000001000100000000000000000000
//	printf("n的值为：%d\n", n);  //1091567616
//	printf("*pfloat的值为：%f\n", *pfloat);//9.000000
//	return 0;
//}



//int main()
//{
//	unsigned char i = 0;
//	for (i = 0; i <= 255; i++)
//	{
//		printf("Hello world\n");
//	}
//	return 0;
//}



//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d\n", strlen(a));
//	return 0;
//}



//#include <Windows.h>
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(100);
//	}
//	//死循环  因为无符号的数字永远>=0
//	return 0;
//}



//int main()
//{
//	int i = -20;
//	//10000000 00000000 00000000 00010100 - 原码
//	//11111111 11111111 11111111 11101011 - 反码
//	//11111111 11111111 11111111 11101100 - 补码
//	unsigned int j = 10;
//	//00000000 00000000 00000000 00001010 - 原码 - 补码
//	printf("%d\n", i + j); // -10
//	//按照补码的形式进行运算，最后格式化为有符号整数
//	//11111111 11111111 11111111 11101100 - i
//	//00000000 00000000 00000000 00001010 - j
//	//11111111 11111111 11111111 11110110 - sum - 补码
//	//11111111 11111111 11111111 11110101 - 反码
//	//10000000 00000000 00000000 00001010 - 原码 = -10 
//	return 0;
//}



//int main()
//{
//	char a = -128;
//	// 10000000000000000000000010000000 - 原码
//	// 11111111111111111111111101111111 - 反码
//	// 11111111111111111111111110000000 - 补码
//	// 10000000
//	// 11111111111111111111111110000000 - 整型提升后的补码
//	// 因为打印的是无符号的数字，原码与补码相同
//	// 转换成十进制就是 4294967168
//	printf("%u\n", a);
//	// %d 打印十进制的有符号数字
//	// %u 打印十进制的无符号数字
//	return 0;
//}



//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001 - 原码
//	//11111111111111111111111111111110 - 反码
//	//11111111111111111111111111111111 - 补码
//	signed char b = -1;
//	unsigned char c = -1;
//	printf("a = %d\nb = %d\nc = %d\n", a, b, c);
//	return 0;
//}



////判断小端优化
//int check_sys()
//{
//	int a = 1;
//	//返回1-小端
//	//返回0-大端
//	return *(char*)&a;
//}
//
//int main()
//{
//	int ret = check_sys();
//	if (ret == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//	return 0;
//}



////写一段代码告诉我们当前机器的字节序是什么
//int main()
//{
//	int a = 1;
//	//00000000000000000000000000000001
//	//0x00 00 00 01
//	//char* pa = &a;  //如果直接赋值会警告char*和int*不兼容，我们使用强制类型转换
//	char* pa = (char*)&a;
//
//	if (*pa == 1)
//		printf("当前机器是小端字节序\n");
//	else
//		printf("当前机器是大端字节序\n");
//
//	//printf("%d\n", *pa);
//	//printf("%d\n", *(pa + 1));
//	//printf("%d\n", *(pa + 2));
//	//printf("%d\n", *(pa + 3));
//
//	return 0;
//}



//int main()
//{
//	// int 在内存中存的是二进制补码
//	int a = 20;	
//	//00000000000000000000000000010100 - 原码
//	//00000000000000000000000000010100 - 反码
//	//00000000000000000000000000010100 - 补码
//	//0x00000014
//	int b = -10;
//	//10000000000000000000000000001010 - 原码
//	//11111111111111111111111111110101 - 反码
//	//11111111111111111111111111110110 - 补码
//	//0xfffffff6
//
//	int c = 0x11223344;
//	//在内存中 44 33 22 11 ，是小端模式 - 低位存储在高地址
//
//	return 0;
//}



//void test(void)  // 如果函数没有指定参数，即使传参了，也不会报错。如果明确写了void，则会警告
//{
//	printf("hehe\n");
//}
//
//int main()
//{
//	test(100);
//	return 0;
//}



//int main()
//{
//    int a = 10;
//    float b = 10.0;  // 整型和浮点型存储方式不一样
//
//    return 0;
//}